# NonContinuousRailStructure Properties

---
The NonContinuousRailStructure type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
NonContinuousRailStructure Class
Autodesk.Revit.DB.Architecture Namespace